<?php
/**
 * 标识码
 *
 * PHP Version 5
 *
 * @category  Social
 * @package   BASE
 * @author    linxinliang <linxinliang@iyangpin.com>
 * @time      2015/8/05
 * @copyright 2015 灵韬致胜（北京）科技发展有限公司
 * @license   http://www.i500m.com license
 * @link      linxinliang@iyangpin.com
 */
return [
	//200-999 公用部分
    '200'  => '操作成功',
    '403'  => '登陆用户无权限访问',
    '506'  => '该用户不存在',
    '507'  => '用户已被禁用',
    '508'  => '账号在另一台机器访问',
    '509'  => '登陆已过期',

    '604' => '用户名不能为空',
    '605' => '手机号格式不正确',

    //1000-1999 用户部分

    //2000-2999 群组部分
    '2001' => '头像不能为空',
    '2002' => '名称不能为空',
    '2003' => '类别不能为空',
    '2004' => '用户每天建群数量不能超过500',
    '2005' => '群组id不能为空',
    '2006' => '加入群组的用户手机号不能为空',

    //3000-3999 活动部分
    '3001' => '活动ID不能为空',

    //4000-4999 邻居说部分

];
